using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using System.Drawing;
using System.IO;

namespace FortuneTelling
{
    internal class Tarot: System.Windows.Forms.Form
    {
        private static Random random = new Random();
        public static string[][] TarotData = { 
            new string[]  { "ace-of-cups", "ความรักก็ดีนะ" , "ฟลุ๊ค โชคดี โชคลาภ ลาภลอย ถ้าคุณถามถึงคุณทำงานอะไร คุณอาจจะมีบ้านที่เปิดเช่าอยู่"},
            new string[]  { "ace-of-pentacles", "ความรักจะสำเร็จ" , "เงินทอง ความสำเร็จ การเริ่มต้น จุดเริ่มต้นของความมั่นคงมาถึงแล้ว เตรียมรับให้ดี" },
            new string[]  { "ace-of-swords", "ถ้าคุณกำลังรักใครอยู่ ให้เดินหน้าจีบได้เลย จะสำเร็จหรือมีคนให้ความช่วยเหลือกับความรักของคุณ" , "ความสำเร็จ จุดเริ่มต้นของสิ่งใหม่ ๆ มีคนยื่นโอกาสดี ๆ เข้ามาให้"},
            new string[]  { "ace-of-wands", "สื่อถึงกำลังจะได้รับฟังข่าวดีหรือได้โอกาสน่ะ" , "การได้รับข่าวสาร ได้รับโอกาส หรือได้เริ่มต้นกิจกรรมบางอย่าง"},
            new string[]  { "death", "ความรักอาจจะต้องเริ่มต้นใหม่ เพราะความรักได้จบลง"
                , "ไพ่ใบนี้เปรียบเสมือนการเริ่มต้นใหม่ ขึ้นอยู่กับว่ามีเกณฑ์จะไปหาหมอหรือเดินทางไกลหรือไม่ ถ้ามีเดินทางไกลให้พักเอาไว้ก่อน" },
            new string[]  { "eight-of-cups", "ความรักอาจกำลังเกิดการจากลา หรือเลิกรากัน","การจากลา ทอดทิ้ง การเดินหนีจากสิ่งที่ทำให้ผิดหวัง หรือเรื่องนั้น ๆ ได้จบลงแล้ว ได้เวลาก้าวต่อไป" },
            new string[]  { "eight-of-pentacles", "ถ้าอยากสมหวังในรัก ก็ต้องใช้ความพยายามจึงจะสมหวัง" , "ขยัน ทุ่มเท ขยันทำงานสร้างเงินทองและความมั่นคงของฐานะ ต้องทำงานถึงจะได้เงิน"},
            new string[]  { "eight-of-swords", "คุณอาจจะกำลังถูกกดดันหรือถูกปิดบังเรื่องอะไรบางอย่างเอาไว้นะ" , "การถูกบีบบังคับจากสถานการณ์ต่าง ๆ รอบตัวจนไม่อาจขยับตัวทำอะไรได้ หรือถูกปิดหูปิดตา" },
            new string[]  { "eight-of-wands", "อาจมีการเดินทางไกล ไพ่ใบนี้เมื่อเปิดพบอาจสื่อถึงฝ่ายใดฝ่ายหนึ่งที่ต้องออกเดินทางไปไกล" , "ข่าวสาร การติดต่อสื่อสารจากทางไกล หรือมีโอกาสได้เดินทางไกล"},
            new string[]  { "five-of-cups", "เรื่องความรักระวังผิดหวัง" , "การสูญเสีย ความเศร้า เหมือนถ้วยที่ล้มลง ความรู้สึกสิ้นหวัง ความหวังพังทลาย" },
            new string[]  { "five-of-pentacles", "ระวังความรักที่แยกจากกันหรือมีความรักที่อาจยากลำบาก" , "มีปัญหาทางการเงิน การแยกจากกัน ความลำบาก ช่วยเหลือคนอื่นไม่ได้ และคนอื่นก็ไม่ได้ช่วยเหลือเช่นกัน"},
            new string[]  { "five-of-swords", "ระวังการทะเลาะเบาะแว้งเอาไว้" , "ปัญหาต่าง ๆ ที่ถาโถมเข้ามา การไม่ลงรอยกันกับคนรอบตัว รวมไปถึงการสูญเสียบางสิ่งบางอย่าง"},
            new string[]  { "five-of-wands", "ระวังการทะเลาะหรือพบอุปสรรคในชีวิตคู่", "การแข่งขันกับคนหมู่มาก อุปสรรคเยอะมาก หรือทะเลาะเบาะแว้ง ไม่ลงรอยกัน" },
            new string[]  { "four-of-cups", "คุณอาจกำลังรู้สึกเบื่อหน่ายกับความรัก" , "ความเบื่อหน่าย แม้จะมีความสุข มีสิ่งดี ๆ รายล้อม แต่กลับเบื่อหน่ายเพราะอยู่แต่ในกรอบเดิม ๆ"},
            new string[]  { "four-of-pentacles", "ความรักที่มั่นคง" , "ความมั่นคง ความร่ำรวย เก็บเงินเก่งจนสร้างความมั่นคงให้ชีวิตได้ดี"},
            new string[]  { "four-of-swords", "คุณอาจจะกำลังโดนคนรอบข้างกดดันกับเรื่องความรัก หรือคุณอาจจะกำลังรู้สึกอยากจะพักกับความรักเอาไว้ก่อน" , "การพักผ่อน นิ่งเฉย โดนกดดันจากรอบตัวจนไม่อาจตัดสินใจอะไรได้"},
            new string[]  { "four-of-wands", "ความรักเป็นไปได้ด้วยดี สุขสมหวัง และถ้าคุณมีแพลนจะขอแต่งงานก็จะได้เฉลิมฉลองหรือสำเร็จนั่นเอง" , "การเฉลิมฉลอง การแต่งงาน หรือความสุขสมหวัง" },
            new string[]  { "judgement", "คิดอยากทำอะไรทำเลย" , "กงกรรมกงเกวียน(ฐานบุญเก่า) คิดอยากทำอะไรทำเลย"},
            new string[]  { "justice", "ความรักได้พบคนซื่อตรง คนยุติธรรม" , "คุณเป็นคนตรง คนยุติธรรม ได้พบเจอคนช่วยเหลือ" },
            new string[]  { "king-of-cups", "ความรัก คุณควรหนักแน่น และใช้เหตุผลมากกว่าอารมณ์ในการตัดสินใจ", "ฉลาด สุขุม อดทน แม้ว่าจะต้องเจอกับเหตุการณ์ไม่มั่นคงใด ๆ ก็ต้องวางตัวหนักแน่  ใช้เหตุผลมากกว่าอารมณ์"},
            new string[]  { "king-of-pentacles", "หากคุณกำลังหวังความรัก คุณจะสมหวัง", "ประสบความสำเร็จ ร่ำรวย มีเงินทองมากมาย หวังสิ่งใดก็จะได้สิ่งนั้น ไม่ขัดสน ไม่ลำบาก"  },
            new string[]  { "king-of-swords", "หากความรักของคุณมีอุปสรรค คุณจะสามารถผ่านไปได้ถ้าใช้ความคิดและความตั้งใจที่มากเพียงพอ" , "ความมุ่งมั่น ความเด็ดเดี่ยว การคิดวิเคราะห์ หากเจออุปสรรคใด ๆ ต้องใช้ทั้ง 3 อย่างเพื่อผ่านไปให้ได้" },
            new string[]  { "king-of-wands", "มันดูเป็นความรักที่มั่นคงนะ สำหรับความเห็นเรื่องคนรักของคุณ ฉันคิดว่าเขาเป็นคนที่น่าเชื่อถือนะ" , "การมีอำนาจ มีไอเดียใหม่ ๆ กล้าหาญ ความมั่นคงและน่าเชื่อถือ" },
            new string[]  { "knight-of-cups", "ถ้าคุณมีความรัก ด้วยนิสัยของคุณ คุณจะมุ่งมั่นกับความรักมาก" , "นักสู้ นักฝัน การขอร้อง ขอแต่งงาน อยากได้สิ่งใดก็ต้องออกไปฝ่าฟันเอามาให้ได้" },
            new string[]  { "knight-of-pentacles", "คุณเป็นคนรักอิสระ แต่หากมีคนรัก คุณชอบคนที่มีความละเอียด และใส่ใจ" , "ความละเอียด การใส่ใจ รักอิสระ กล้าออกไปหาเส้นทางใหม่ ๆ"},
            new string[]  { "knight-of-swords", "คุณรักเขามากหรือเปล่า ความรักของคุณจะต้องเหนื่อยมาก แต่ถ้าคุณพยายามมาก ๆ คุณจะได้ในสิ่งที่คุณต้องการนะ" , "การต่อสู้ ฝ่าฟัน ศัตรู ต้องออกแรงค่อนข้างเยอะ ต้องเหนื่อย ต้องสู้ แล้วถึงจะได้ในสิ่งที่ต้องการ" },
            new string[]  { "knight-of-wands", "ในเรื่องของความรัก คุณเป็นคนที่ยึดมั่น และมีความเชื่อมั่นมากกับตัวของคนที่คุณรัก คุณกล้าที่จะเสี่ยงกับความรักที่คุณมีเสมอ เพราะคุณเชื่อมั่นในความรักและตัวที่คุณรัก" , "มั่นใจในตัวเอง ชอบเสี่ยง การลงมือทำสิ่งต่าง ๆ ด้วยความรวดเร็วว่องไว" },
            new string[]  { "nine-of-cups", "ความรักของคุณจะสมหวัง" , "สมหวัง ความหวังเป็นจริง สิ่งที่อยากได้กำลังจะกลายเป็นจริงแล้วนะคะ นั่งรอได้เลย" },
            new string[]  { "nine-of-pentacles", "สื่อถึงความรักที่มั่งคง" , "มั่นคง มั่งคั่ง มีเงินเก็บมากมาย มีความสบายพร้อมทุกด้าน"},
            new string[]  { "nine-of-swords", "คุณกำลังคิดมากหรือเครียดกับความรักอยู่" , " ความเครียด ความกังวล ปวดหัว คิดมาก รุนแรงถึงขั้นนอนไม่หลับ" },
            new string[]  { "nine-of-wands", "มีเรื่องสำคัญที่เกี่ยวเนื่องกับความรักให้ตัดสินใจ" , "ความเข้มแข็งและมุ่งมั่น การตัดสินใจเลือกสิ่งสำคัญ การป้องกันตัวเอง"},
            new string[]  { "page-of-cups", "คุณจะได้พบคนมากมายหรืออาจได้รับข่าวสารบางอย่างหรือรับรู้เรื่องอะไรบางอย่าง" , "ความสนุก ชอบเข้าสังคม ได้พบเจอกับคนมากหน้าหลายตา หรืออาจได้รับข่าวสารบางอย่าง"},
            new string[]  { "page-of-pentacles", "คุณได้รับโอกาสในความรัก ถึงแม้จะเป็นโอกาสที่อาจจะเล็ก ๆ" , "ได้รับข้อเสนอ ได้รับโอกาสดี ๆ แม้จะเป็นเพียงการเริ่มต้นเล็ก ๆ ก็ตาม" },
            new string[]  { "page-of-swords", "อดทนเอาไว้ รวมทั้งเชื่อมั่นในตัวเอง ทุกอย่างจะเป็นไปได้ด้วยดีนะ อุปสรรคสามารถผ่านไปได้" , "การใช้สัญชาตญาณในการตัดสินใจ เชื่อมั่นในตัวเอง และต้องอดทนเอาไว้แล้วจะชนะอุปสรรคต่าง ๆ ได้" },
            new string[]  { "page-of-wands", "คุณเป็นคนที่ตัดสินใจอะไรไปแล้ว คุณก็จะยึดตามนั้นนั่นแหละ คุณมุ่งมั่นกับสิ่งที่เลือกมาก และคุณอาจได้รับข่าวสารบางอย่างนะ" , "ได้รับข่าวสาร กระตือรือร้น กล้าหาญ มุ่งมั่นกับสิ่งที่เลือกแล้ว" },
            new string[]  { "queen-of-cups", "หากคุณกำลังต้องตัดสินใจอะไรสักอย่างกับความรัก คุณต้องตัดสินใจด้วยความรอบคอบ", "สัญชาตญาณดี การพิจารณา หากต้องตัดสินใจอะไรก็ตาม ต้องคิดทบทวนอย่างรอบคอบ" },
            new string[]  { "queen-of-pentacles", "ความรักที่ดี เป็นไปด้วยดี", "ใจกว้าง ความอุดมสมบูรณ์ การคิดพิจารณาอย่างละเอียดรอบคอบ" },
            new string[]  { "queen-of-swords", "คุณเป็นคนที่เด็ดขาดมาก รวมทั้งเป็นคนที่รักอิสระ ไม่ชอบใครที่มาบังคับสิ่งที่คุณได้ตั้งใจเอาไว้แล้ว" , "ความอิสระเสรี ความตรงไปตรงมา ความเด็ดเดี่ยว จัดการสิ่งใดด้วยความเด็ดขาด ไม่ลังเล"},
            new string[]  { "queen-of-wands", "ถ้าคุณได้มีความรัก ฉันคิดว่ามันเป็นความรักที่ดีนะ ความรักที่คุณจะได้เป็นตัวของตัวเอง และไม่ถูกใครบังคับน่ะ" , "การมีความคิดสร้างสรรค์ การเป็นตัวของตัวเอง"},
            new string[]  { "seven-of-cups", "คุณกำลังมีความสับสนในความรักหรืออาจมีคนที่คุณรู้สึกชอบหลายคนหรือคนมาชอบคุณหลายคนจนตัดสินใจเลือกไม่ถูก" , "ความสับสน ตัวเลือกเยอะ เกิดขึ้นได้จากความรู้สึกที่มีมากมายเกินความจำเป็น หรือแม้แต่มีข้อเสนอเข้ามาเยอะมากจนตัดสินใจไม่ถูก" },
            new string[]  { "seven-of-pentacles", "ถ้าคุณกำลังพยายามในการจีบใครอยู่ คุณจะประสบความสำเร็จ เขาจะมองเห็นความรักที่คุณมอบให้" , "การลงทุน รางวัลตอบแทน ได้รับผลตอบแทนของการทำงานที่ผ่านมา"},
            new string[]  { "seven-of-swords", "อาจสื่อถึงมีฝ่ายใดฝ่ายหนึ่งที่ทำผิดกับคนรักเอาไว้", "การขโมย ทำเรื่องผิดกฎหมายต่าง ๆ รวมถึงงานที่มีเยอะมากจนล้นมือทำไม่ทัน"  },
            new string[]  { "seven-of-wands", "ไพ่สื่อถึงอุปสรรคและการป้องกันตัวเอง อาจมีความหมายถึงมีอุปสรรคที่เข้ามา แต่คุณและคู่ชีวิตจะร่วมกันเผชิญกับอุปสรรคนั้น" , "ความยึดมั่น การปกป้องตัวเอง อุปสรรคหรือภาระที่ถาโถมเข้ามาพร้อม ๆ กัน" },
            new string[]  { "six-of-cups", "ความรักที่สงบสุข" , "ความสงบสุข มีคนมาเยี่ยม อาจได้รับเซอร์ไพรส์จากคนอื่น มีการมาหาแบบไม่ทันตั้งตัว ได้รับของฝาก"},
            new string[]  { "six-of-pentacles", "เป็นความรักที่ไม่เท่ากัน มีคนใดคนหนึ่งที่ให้ความรักมากกว่ากัน","ความมีน้ำใจ การแบ่งปัน แต่ก็เป็นการแบ่งปันที่ไม่เท่าเทียม ฝ่ายใดฝ่ายหนึ่งได้มากกว่า" },
            new string[]  { "six-of-swords", "หากคุณกำลังมีเรื่องอะไรที่เก็บเอาไว้ในใจ คุณไม่ควรละเลยหรือปล่อยมันทิ้งเอาไว้นะ หรือคุณควรใส่ใจคนรักของคุณให้มากกว่านี้" , "การละเลยปัญหา เพิกเฉยต่อปัญหา จนบานปลายและทำให้ตกอยู่ในสภาวะจำยอม หรือต้องปล่อยตัวเองไปตามน้ำ" },
            new string[]  { "six-of-wands", "ไพ่สื่อถึงความสำเร็จ ขึ้นอยู่กับข้อสงสัยของคุณ อาจเป็นความรักที่สำเร็จก็ได้", "ชัยชนะ ความสำเร็จ การเฉลิมฉลองความสำเร็จ" },
            new string[]  { "strength", "หากคุณจับได้ไพ่ใบนี้ หากคุณเป็นผู้ชายแสดงว่าคุณเป็นคนที่กลัวภรรยา มีความเกรงใจภรรยา มีภรรยาที่เก่ง และหากคุณเป็นผู้หญิง คุณคือผู้หญิงที่เก่ง และแกร่ง\nหากคุณเป็นผู้หญิงคำแนะนำควรแต่งงานช้าหน่อย"
                , "หากคุณจับได้ไพ่ใบนี้ หากคุณเป็นผู้ชายแสดงว่าคุณเป็นคนที่กลัวแฟน อยู่ในโอวาท\nหากคุณเป็นผู้หญิง คุณเป็นผู้หญิงแกร่งที่สามารถผ่านเรื่องต่าง ๆ ได้" },
            new string[]  { "temperance", "ความรักของคุณ คุณมีความรู้สึกไม่แน่นอนว่าจะตัดสินใจยังไงกับความรักครั้งนี้"
                , "ความไม่แน่นอนเปรียบเสมือนน้ำในแก้วที่เทไปเทมา คุณเป็นคนไม่แน่นอน ชอบคุยโทรศัพท์ ชอบไปเที่ยว ชอบเดินทาง" },
            new string[]  { "ten-of-cups", "ความรักของคุณจะมีความสุข และเป็นไปได้ด้วยดีนะ" ,"ความสุข ครอบครัว การมีทุกอย่างพร้อม มีความสุขแบบสุด ๆ" },
            new string[]  { "ten-of-pentacles", "ความรักเป็นไปได้ด้วยดีมากเลยนะ และคุณอาจจะได้แต่งงาน" , "การแต่งงาน ได้รับมรดก ชีวิตดี ๆ ครอบครัวดี เงินดี ชีวิตที่พร้อมทุก ๆ ด้าน"},
            new string[]  { "ten-of-swords", "ถ้าความรักของคุณพบเจอเรื่องแย่ ๆ ในอีกไม่นาน มันจะจบลงนะ", "จุดจบ สิ้นสุด เรื่องเครียดและปวดหัวต่าง ๆ จะจบลงในไม่ช้า"  },
            new string[]  { "ten-of-wands", "มีเรื่องเกิดขึ้นมากมาย ฉันคิดว่าคุณอาจจะรู้สึกเหนื่อยนะ" , "ภาระหน้าที่หรือการทำงานมากเกินไปจนไม่สามารถขยับตัวไปทำสิ่งอื่น ๆ ได้"},
            new string[]  { "the-chariot", "เรื่องของความรัก หากคุณรักใคร ให้คุณใช้ความมุ่งมั่น ตั้งใจ และความรักของคุณจะประสบความสำเร็จ", "หากคุณจับได้ไพ่ใบนี้ คุณมีดวงเจ้าคนนายคน มีลูกน้องและบริวารมากมาย และหากคุณมีความมุ่งมั่นตั้งใจ คุณจะประสบความสำเร็จ" },
            new string[]  { "the-devil", "ความรักครั้งนี้เหมือนคุณได้เจอคนไม่ค่อยดีนะ เหมือนเขามาหลอกลวงคุณ ระวังนะ ต้องดูให้ดี" , "สื่อเป็นคนที่มีอะไรลึกลับอยู่ในตัว เป็นคนลึกลับ อาจสื่อถึงคุณกำลังได้พบเจอกับคนไม่ดีก็ได้" },
            new string[]  { "the-emperor", "หากคุณจับได้ไพ่ใบนี้ หากคุณเป็นผู้ชายความรักของคุณก็จะประสบความสำเร็จ มีแต่คนมาชอบคุณ\nหากคุณเป็นผู้หญิง คุณจะมีแฟนที่เป็นคนไม่ค่อยพูด มีเงิน และสมบูรณ์แบบ"
                ,"หากคุณจับได้ไพ่ใบนี้ หากคุณเป็นผู้ชาย คุณเป็นคนเก่ง เป็นเงียบขรึม ทำอะไรก็ประสบความสำเร็จ\nหากคุณเป็นผู้หญิง หมายความว่าสิ่งที่คุณทำจะประสบความสำเร็จ"},
            new string[]  { "the-empress", "หากคุณจับได้ไพ่ใบนี้ ความรักของคุณเป็นไปได้ด้วยดี และหากคุณเป็นผู้ชาย ภรรยาของคุณมีโอกาสตั้งครรภ์ และหากคุณเป็นผู้หญิง คุณมีโอกาสที่จะตั้งครรภ์"
                ,"หากคุณจับได้ไพ่ใบนี้ คุณจะมีชีวิตที่สุขสบาย อุดมสมบูรณ์ มีกินมีใช้ไม่ขาดสาย" },
            new string[]  { "the-fool", 
                "หากคุณหยิบได้ไพ่ใบนี้ หมายความว่าคุณอาจได้มีความรักที่ไม่มีห่วงอะไร อาจเป็นรักเล่น ๆ หรือรักที่ไม่แน่นอน หรืออาจเป็นความรักที่ได้พบกับคนที่เจ้าชู้ และอาจเป็นตัวคุณเองที่ไม่จริงจังกับความรักนี้"
            ,"หากคุณหยิบได้ไพ่ใบนี้ ไพ่ใบนี้บ่งบอกว่าคุณเป็นคนสนุกสนาน ไม่ค่อยคิดมากอะไร ชอบเที่ยว หากมีภัยเมื่อไหร่ก็จะมีคนหรือสิ่งศักดิ์สิทธิ์คอยให้ความช่วยเหลือ เป็นคนซื่อสัตย์"},
            new string[]  { "the-hanged-man", "ความรักนี้แสดงว่าคุณอาจทะเลาะกับคนรักของคุณอยู่ และคุณอาจกำลังรอคอยการตัดสินใจ ควรเปิดไพ่อีกครั้งเพื่อดูไพ่สำหรับตัดสินใจประกอบ", "คนซุ่มซ่าม ระวังการทะเลาะหรือคุณอาจกำลังรอคอยอะไรสักอย่างอยู่ มีการได้อย่างเสียอย่าง รวมทั้งอาจระบุไปถึงเรื่องโรคประจำตัวเป็นเรื่องของกระเพาะก็ได้ คำแนะนำคุณควรรับประทานอาหารให้ตรงเวลา" },
            new string[]  { "the-heirophant", "เรื่องความรักให้หยุดพักไว้ก่อน", "เป็นคนมีการศึกษาสูง ได้เรียนถึงระดับดอกเตอร์" },
            new string[]  { "the-hermit", "ได้แฟนที่อายุมากกว่า","คุณเป็นคนชอบเข้าวัด รักสันโดษ ชอบความเงียบ รักความสงบ ชอบนั่งสมาธิ" },
            new string[]  { "the-high-priestess", "หากคุณจับได้ไพ่ใบนี้ หากคุณเป็นผู้ชาย แสดงว่าคุณมีผู้หญิงคนหนึ่งที่คุณชอบอยู๋ และดูแลเขาอยู่ \nและหากคุณเป็นผู้หญิง แสดงว่าคุณเป็นคนสวย คนมีเสน่ห์ คนเก่ง และเป็นที่ชื่นชอบ"
                , "หากคุณจับได้ไพ่ใบนี้ หมายถึงความฉลาด มีความรู้ มีความสามารถ เป็นตัวแทนของคนเก่งมากความสามารถ แต่มักซ่อนสิ่งนั้นเอาไว้ภายในรูปลักษณ์นิ่งเงียบที่แสดงให้ภายนอกได้เห็น"},
            new string[]  { "the-lovers", "คุณเป็นคนที่ถ้าใครเจอคุณก็จะชอบคุณ แต่ว่าเรื่องของความรักของคุณ หากคุณรักใคร คุณจะไม่ได้แต่งงานกับเขา แต่ได้อยู่ด้วยกัน" 
                , "คุณเป็นคนมีความสามารถ สามารถทำงานหลายอย่างได้ในคนเดียว คุณเป็นคนมีเสน่ห์ ใครพบคุณก็จะชอบคุณ"},
            new string[]  { "the-magician", "หากคุณจับได้ไพ่ใบนี้ คุณเป็นคนเซ้นส์แรงมาก ๆ จนเหมือนเป็นนักมายากล หรือการลงมือทำ ดังนั้นในเรื่องความรักก็ให้ลงมือเดินหน้าได้เต็มที่" 
                , "หากคุณจับได้ไพ่ใบนี้ บ่งบอกว่าคุณอาจเรียนอีกอย่างหนึ่งแล้วได้ทำในอีกอย่างหนึ่ง อาทิ จบจากคณะหนึ่งได้ทำงานในคนละสายกับที่เรียน เป็นคนเซ้นส์แรง"},
            new string[]  { "the-moon", "คุณกำลังรู้สึกวิตกกังวลกับความรัก" , "คนอารมณ์แปรปรวน วิตกกังวล อาจมีการทำบ้าน การซ่อมบ้าน หรือย้ายบ้าน"},
            new string[]  { "the-star", "ความรักจะมีแต่คนรักคุณ เป็นที่ชื่นชอบคนทุก ๆ คน" , "จะมีการเกิดใหม่ ไปอยู่ที่ไหนก็มีการเกิดใหม่ เป็นดาวรุ่ง ถ้าคุณเรียนอยู่ก็เปรียบเสมือนเป็นดาวคณะที่มีแต่คนชื่นชอบ ไปอยู่ที่ไหนก็มีแต่การเกิดใหม่ การเจริญงอกงาม ทำอะไรก็ประสบความสำเร็จ"},
            new string[]  { "the-sun", "ความรักของคุณนั้นเป็นไปได้ด้วยดี และจะสมหวัง ระวังการตั้งครรภ์", "โชคดีในทุก ๆ เรื่อง ๆ เร็ว ๆ นี้เหมือนกำลังจะมีเรื่องดี ๆ เกิดขึ้นกับคุณนะ" },
            new string[]  { "the-tower", "อกหัก ผิดหวัง หย่าร้าง" , "เปิดได้ไพ่นี้ระวังเรื่องการอกหัก หรือตอนนี้คุณอาจกำลังผิดหวังเรื่องอะไรอยู่ อาจมีเรื่องกระทันหันเช่นจู่ ๆ คุณก็หกล้ม ชนนู่นชนนี่ หรือระวังอุบัติเหตุ"},
            new string[]  { "the-world", "ความรักสมหวัง มีแฟนที่เลี้ยงดูแล", "การท่องเที่ยว มีแฟนเลี้ยงหรือสุขสบาย ได้ท่องเที่ยวทั่วโลก สถานที่ไหนก็เคยไปมาหมดแล้ว"},
            new string[]  { "three-of-cups", "ถ้าคุณชอบใคร จะมีคนมาคอยเชียร์ เช่น เพื่อนฝูงหรือญาติพี่น้อง" , "คุณกำลังจะได้เฉลิมฉลองในเร็ว ๆ นี้"},
            new string[]  { "three-of-pentacles", "คนที่คุณชอบเป็นคนที่โชคดีมาก เพราะคุณเป็นคนที่มีการวางแผนในอนาคตเอาไว้ คุณอาจจะวางแผนที่สร้างอนาคตร่วมกันกับเขาอยู่" , "การแสดงความสามารถออกมาให้คนอื่นเห็น การมุ่งมั่นสร้างฐานะ"},
            new string[]  { "three-of-swords", "อาจต้องผิดหวังหรือเสียใจในเรื่องความรัก" , "ความเสียใจ ใจสลาย ต้องเจอเรื่องผิดหวัง และยังหมายถึงเจอฝนถล่มก็ได้" },
            new string[]  { "three-of-wands", "อาจเกิดเหตุการณ์ให้ต้องเดินทางหรือเหตุการณ์ที่เข้ามาในชีวิตคู่", "การเดินทางไปยังที่ที่ไม่คุ้นเคย ทำในสิ่งที่กลัว หรือการมองการณ์ไกล" },
            new string[]  { "two-of-cups", "จะได้เจอคนรัก คนที่ถูกใจในไม่ช้านี้ เป็นความรักที่รักกันเอง ไม่ได้มีคนแนะนำมาให้" , "จะมีแฟนที่รักกันเอง ไม่ได้มาจากคำแนะนำหรือคำบังคับของใคร แต่จะสมหวังไหม ต้องดูไพ่ใบอื่นด้วยนะ"},
            new string[]  { "two-of-pentacles", "หากคุณมีความรัก คุณกำลังมีเรื่องให้ตัดสินใจ ซึ่งต้องเลือกอย่างระมัดระวัง" ,"การตัดสินใจ การเลือกด้วยความระมัดระวัง และยังหมายถึงการหมุนเงินอีกด้วย"},
            new string[]  { "two-of-swords", "คุณกำลังมีเรื่องคิดมากกับความรักจนเลือกไม่ได้ว่าจะทำอย่างไรหรือตัดสินใจยังไง" , "การจนมุม ขยับตัวไม่ได้ เลือกไม่ได้ว่าต้องทำอย่างไร ตัดสินใจไม่ได้" },
            new string[]  { "two-of-wands", "ดูเหมือนคุณจะวางแผนเอาไว้แล้วนะ ถ้าคุณกำลังมีคนที่ชอบ คุณกำลังวางแผนที่จะเดินหน้าจีบเขา และถ้าหากคุณมีคนที่ชอบแล้ว คุณกำลังวางแผนใช้ชีวิตคู่กับเขาเลยแหละ" , "การวางแผนการต่าง ๆ ในอนาคต ความกล้าหาญ กล้าจะก้าวออกไปยังโลกอันไม่คุ้นเคย" },
            new string[]  { "wheel-of-fortune", "ความรักก็มีการเปลี่ยนแปลงที่ดีขึ้น ได้อยู่ด้วยกัน มีความพร้อม" , "วงล้อแห่งโชคลาภ ดวงในอนาคตคุณจะมีบ้าน มีอสังหาริมทรัพย์"},
        };
        private static int lengthTarotData = TarotData.Length;

        public Tarot()
        {
            coordinates();
        }

        //พิกัดของไพ่
        public void coordinates(){
            int X, nNew;
            for (int n = 0;n<= lengthTarotData - 1; n++)
            {
                /*
                 ไพ่ใบแรกเริ่มต้นขวามือสุดที่พิกัด 925,615
                ไพ่ใบสุดท้ายของแถวแรกมีพิกัด 0,615
                ทำการขยับไพ่ทีละ 37 ตามแนวพิกัดแกน X เป็นดังสมการ
                925 -37n เมื่อ n = 0,1,2,3,...,25 (n+1 = ไพ่ใบที่...)
                หมายเหตุ : 925 - 37n เมื่อ n = 0 ได้925 คือพิกัดแกน x ของไพ่ใบแรกสุด
                หนึ่งแถวจะมีได้สูงสุด 925 - 37n = 0
                ได้ 25
                ดังนั้นมีทั้งหมด 26 ใบ ตั้งแต่ 0,1,2,3,...,25
                 */
                if(n<=25)
                { 
                    X = 925 - (37 * (n));
                    dataManagement.AddData(TarotData, n, new string[] { X.ToString(), "615" });
                }
                else if(n<=51) //จำนวนแถวที่สองเป็นจำนวน 26 ใบ ตั้งแต่ 26 ถึง 51
                {
                    nNew = n % 26; //แถวที่สอง
                    /*ตามสมการที่คำนวณเอาไว้ 925 - 37n เมื่อ n = 0,1,2,3,...,25
                     ดังนั้นจึงต้องทำให้ n ในที่นี้กลายเป็น n ตามสมการ*/
                    X = 925 - (37 * (nNew));
                    dataManagement.AddData(TarotData, n, new string[] { X.ToString(), "453" });
                }
                 else
                {
                    nNew = n % 52;
                    X = 925 - (37 * (nNew));
                    dataManagement.AddData(TarotData, n, new string[] { X.ToString(), "291" });
                }
            }
        }

        //สลับไพ่ สลับส่วนของชื่อและคำอธิบาย
        public void shuffleDetail(int shuffleNumber)
        {
            int randomNumber;
            string nameTarot, explanationLover, explanationDay;
            for(int round = 1; round <= shuffleNumber; round++) {
                for (int i = 0; i <= lengthTarotData - 1; i++)
                {
                    randomNumber = random.Next(lengthTarotData);
                    nameTarot = TarotData[randomNumber][0];
                    explanationLover = TarotData[randomNumber][1];
                    explanationDay = TarotData[randomNumber][2];
                    TarotData[randomNumber][0] = TarotData[i][0];
                    TarotData[randomNumber][1] = TarotData[i][1];
                    TarotData[randomNumber][2] = TarotData[i][2];
                    TarotData[i][0] = nameTarot;
                    TarotData[i][1] = explanationLover;
                    TarotData[i][2] = explanationDay;
                }
            }
        }
    }
}
